# <Задание 2>
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]


spis = [2, 3, 5, 7, 9, 3]
subSpis = []

for i in range(int(len(spis)/2)):
    subSpis.append(spis[i]*spis[-i - 1])
print(subSpis)
