
# count = 0

# num = input("введите искомый символ: ")

# spis = ["sdvsdtg4", "sdre5eygsh", "wef4fergae4", "766krjdhs6"]
# stroka = spis[count]

# flag = True

# for _ in range(len(spis)):
#     if (count == len(spis) + 1):
#         break
#     stroka = spis[count]
#     for i in range(len(stroka)):
#         if (stroka[i] == num):
#             print(f"в {count} элементе массива присутствует {num}")
#             flag = False
#             break
#     count += 1
# if flag: 
#     print("такого элемента не найдено.")





# Кирилл (Стоун): 3. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# *Пример:*

# count = 0

# spis = ["123", "234", 123, "123", "kbu"]

# findNum = input("введите искомый элемент: ")

# for i in range(len(spis)):
#     if (findNum == spis[i]):
#         count += 1
#     elif (count == 2): 
#         print(f"индекс элемента второго вхождения = {i}")
#         break
#     elif (i + 1 == len(spis) and count == 1):
#         print("элемент входит в список единожды")
# if (count == 0):
#     print("такого элемента в списке нет")


