# ввести 2 числа с клавиатуры и найти НОК для обоих

# num1 = int(input('введите первое число: '))
# num2 = int(input('введите второе число: '))

# spis1 = []
# spis2 = []

# i = 2
# while (num1 >= 2):
#     if num1/i == int(num1/i) :
#         num1 = num1/i
#         spis1.append(i)
#     else:
#         i += 1
# j = 2
# while (num2 >= 2):
#     if num2/j == int(num2/j) :
#         num2 = num2/j
#         spis2.append(j)
#     else:
#         j += 1

# for i in range (len(spis1)):
#     count = 0
#     for j in range (len(spis2)):
#         if spis1[i] == spis2[j]:
#             count += 1
#         if j == len(spis2) - 1 and count == 0:
#             spis2.append(spis1[i])
# print(spis2)

# res = 1
# count = 0
# for i in range(len(spis2)):
#     count = int(spis2[i])
#     res *= count
# print(res)

# 1. Напишите программу вычисления арифметического выражения заданного строкой.
# Используйте операции +,-,/,*. приоритет операций стандартный.
# *Пример:*
# 2+2 => 4;
# 1+2*3 => 7;
# 1-2*3 => -5;

# data = input('Введите выражение: ')

def sch (a,b,c):
    res = acb

data = '1-2*3'

data = data.replace('-', ' - '). replace('+', ' + ').replace('*', ' * ').replace('/', ' / ')

spis = data.split(' ')

print(spis)























